In [2]:
import pandas as pd

In [3]:
pd.read_csv('my1.csv',header=None)

         0              1     2
0     Jawa  Shahruth Khan  2023
1  Iraivan     Jayan Ravi  2023
2  Khafiya           Tabu  2023

In [4]:
df=pd.read_csv('my1.csv',names=['Movie_name','Actor','Year'])
df

  Movie_name          Actor  Year
0       Jawa  Shahruth Khan  2023
1    Iraivan     Jayan Ravi  2023
2    Khafiya           Tabu  2023

In [5]:
df.index=['m1','m2','m3']
df

   Movie_name          Actor  Year
m1       Jawa  Shahruth Khan  2023
m2    Iraivan     Jayan Ravi  2023
m3    Khafiya           Tabu  2023

In [6]:
df.to_csv("df.csv",sep='\t')

CSV given by sir

In [7]:
pd.read_csv("ex1.csv")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_csv("ex2.csv",header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv('ex3.txt',sep='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [10]:
pd.read_csv('ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
ex5=pd.read_csv('ex5.csv',)
ex5

  something   a   b     c   d message
0       one   1   2   3.0   4     NaN
1       two   5   6   NaN   8   world
2     three   9  10  11.0  12     foo
3      four  13  14   NaN  15    pooh

In [12]:
pd.isna(ex5)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False
3      False  False  False   True  False    False

In [13]:
ex5['message']

0      NaN
1    world
2      foo
3     pooh
Name: message, dtype: object

In [17]:
pd.read_csv("idea.csv")

      Name  Age
0    Soham   18
1    Rohit   19
2  Samarth   19

In [13]:
file = open('geek.txt', 'r')

In [14]:
print (file.read())

Vivan Rohit Soham

In [11]:
f = open('geek.txt', 'w')

In [12]:
f.write("Vivan Rohit Soham")

17

In [16]:
fa =  open('geek.txt','a')

In [17]:
fa.write('other absend')

12